# Задача #3 – пироженки и коробочки

def print_pack_report(total_cakes: int):
    # Перебираем числа в порядке убывания от переданного до 1
    for i in range(total_cakes, 0, -1):
        if i % 3 == 0 and i % 5 == 0:
            print(f"{i} - расфасуем по 3 или по 5")
        elif i % 5 == 0:
            print(f"{i} - расфасуем по 5")
        elif i % 3 == 0:
            print(f"{i} - расфасуем по 3")
        else:
            print(f"{i} - не заказываем!")

# Блок тестирования программы
if __name__ == "__main__":
    # Вызовем функцию с числом 16, чтобы проверить все условия
    print_pack_report(16)